#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Collaboration
#+STARTUP: showall
#+PROPERTY: filename collaboration.org
  :PROPERTIES:
  :Name: /home/deerpig/proj/deerpig/deerpig-install/collaboration.org
  :Created: 2016-08-27T16:28@Wat Phnom (11.5733N17-104.925295W)
  :ID: bc0f8937-4fad-46d8-ac00-eec13f7a5962
  :URL:
  :END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org
#+INCLUDE: ./inc/links.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 6

* Status of This Document

The latest version of this document is: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <div class="notice notice-info">
*Changes since the last version*

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01"
  RES=`git log $TAG...HEAD --pretty="<li>%s</li>\n" -- collaboration.org`
  if [ -z $RES ]; then
    RES="<li>no changes</li>"
  fi
  echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

* Introduction











* Chelpa: Chenla Elpa Mirror Repository

To keep everyone's emacs in sync, so that there are no problems with
deployment, or with dependencies, we run our own Elpa Mirror =CHELPA=.

 https://github.com/redguardtoo/elpa-mirror

* UsePackage

The team maintains an init file named =.emacs-chenla= that includes
usepackage statements that point to all of the packages that are
needed to create, build and export.

* GitoLite

* Git
* Magit



* Critic Markup

http://criticmarkup.com/

** Install CriticMarkup Mode

#+begin_src emacs-lisp
(use-package cm-mode
  :ensure t
  :pin chelpa)
#+end_src

** Markup

- Addition ={++ ++}=
- Deletion ={-- --}=
- Substitution ={~~ ~> ~~}=
- Comment ={>> <<}=
- Highlight ={== ==}{>> <<}=

** Key bindings

  | key-binging | description                             |
  |-------------+-----------------------------------------|
  | C-c * a     | add text                                |
  | C-c * d     | delete text                             |
  | C-c * s     | make a substitution                     |
  | C-c * c     | add a comment                           |
  | C-c * i     | accept/reject change at point           |
  | C-c * I     | accept/reject all changes interactively |
  | C-c * *     | move forward out of a change            |
  | C-c * f     | move forward to the next change         |
  | C-c * b     | move backward to the previous change    |
  | C-c * C     | set author                              |
  | C-c * F     | activate follow changes mode            |
  

